Revit 2026 API

# ExportPatternInfo(ExportPatternInfo) Constructor

---

Constructs a new copy of the input ExportPatternInfo object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportPatternInfo(
	ExportPatternInfo other
)
```
```vb
Public Sub New (
	other As ExportPatternInfo
)
```
```cpp
public:
ExportPatternInfo(
	ExportPatternInfo^ other
)
```
```fsharp
new :
        other : ExportPatternInfo -> ExportPatternInfo
```

#### Parameters

other ExportPatternInfo

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportPatternInfo Class

ExportPatternInfo Overload

Autodesk.Revit.DB Namespace